freesbeeGE/test/dati/g/test8.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ge="http://ge.freesbee.unibas.it/">
    <soap:Header/>
    <soap:Body>
        <ge:consegnaMessaggio>
            <messaggioSoap>
                <ricercaPubblicatori>
                    <pubblicatore>
                        <nomePubblicatore>P</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <pubblicatore>
                        <nomePubblicatore>Q</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <nomeSottoscrittore>M</nomeSottoscrittore>
                    <tipoSottoscrittore>SPC</tipoSottoscrittore>
                    <categoriaSottoscrizione>Test2</categoriaSottoscrizione>
                </ricercaPubblicatori>
            </messaggioSoap>
            <nomePubblicatore>GE</nomePubblicatore>
            <tipoPubblicatore>SPC</tipoPubblicatore>
            <categoriaEventi>GEControlProtocol</categoriaEventi>
        </ge:consegnaMessaggio>
    </soap:Body>
</soap:Envelope>